In [1]:
import pandas as pd

In [3]:
# Crear un DataFrame simple
data = {
 'Nombre': ['Ana', 'Luis', 'Carlos'],
 'Edad': [23, 34, 28]
}
df = pd.DataFrame(data)
# Mostrar el DataFrame
df

   Nombre  Edad
0     Ana    23
1    Luis    34
2  Carlos    28

In [4]:
df.describe()

            Edad
count   3.000000
mean   28.333333
std     5.507571
min    23.000000
25%    25.500000
50%    28.000000
75%    31.000000
max    34.000000

In [5]:
df = pd.read_csv('clientes_banco.csv')
df.head()

   Cliente_ID  Edad     Genero     Saldo  Activo  Nivel_de_Satisfaccion
0           1  24.0        NaN  72699.44     1.0                    4.0
1           2  52.0   Femenino  15084.72     1.0                    2.0
2           3  44.0   Femenino  44786.12     0.0                    5.0
3           4  27.0        NaN  94585.26     0.0                    2.0
4           5  56.0  Masculino  81708.46     NaN                    5.0